doc/BUILD/source/_static/soap_outputs/6.2.314.3321/get_sensor_by_mixed_step_4_request.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <typens:tanium_soap_request xmlns:typens="urn:TaniumSOAP">
      <command>GetObject</command>
      <object_list>
        <sensors>
          <sensor>
            <hash>322086833</hash>
          </sensor>
          <sensor>
            <id>1</id>
          </sensor>
          <sensor>
            <id>2</id>
          </sensor>
          <sensor>
            <name>Computer Name</name>
          </sensor>
        </sensors>
      </object_list>
      <options>
        <suppress_object_list>1</suppress_object_list>
      </options>
    </typens:tanium_soap_request>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>